---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ConstraintFixedOffset
source: html/ac31b144-7f1c-3dca-1af9-6682fa9b2f28.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ConstraintFixedOffset Property

"Fixed offset"

## Syntax (C#)
```csharp
public static ForgeTypeId ConstraintFixedOffset { get; }
```